//【city.js】
cities = new Object();

cities['北京']=new Array('北京市');
cities['上海']=new Array('浦东', '浦西');
cities['天津']=new Array('天津市');
cities['重庆']=new Array('重庆市');

cities['河北省']=new Array('石家庄市','唐山市','保定市','秦皇岛市','衡水市','承德市','廊坊市','沧州市','邯郸市','张家口市','任丘市','邢台市','河间市','泊头市');
cities['山西省']=new Array('太原市','长治市','运城市','大同市','晋城市','临汾市','晋中市','阳泉市','忻州市','高平市','朔州市','吕梁市','霍州市','介休市','孝义市','忻洲市','榆次市','原平市');
cities['辽宁省']=new Array('鞍山－海城市','鞍山－台安县','鞍山－岫岩满族自治县','鞍山－铁东区','鞍山－铁西区','鞍山－立山区','鞍山－千山区','鞍山－鞍山高新区','鞍山－达道湾','鞍山－千山风景名胜区','鞍山－鞍山文化旅游开发区','沈阳市','大连市','盘锦市','葫芦岛市','抚顺市','锦州市','丹东市','铁岭市','阜新市','本溪市','朝阳市','营口市','辽阳市');
cities['吉林省']=new Array('长春市','吉林市','松原市','辽源市','延吉市','四平市','通化市','白山市','白城市','敦化市','珲春市','延边州','和龙市','桦甸市','梅河口市','图们市');
cities['黑龙江省']=new Array('哈尔滨市','大庆市','牡丹江市','鹤岗市','齐齐哈尔市','佳木斯市','鸡西市','伊春市','绥化市','黑河市','双鸭山市','七台河市','大兴安岭地区','加格达奇区','密山市');
cities['江苏省']=new Array('常熟市','泰兴市','靖江市','姜堰市','苏州市','张家港','南京市','徐州市','无锡市','常州市','扬州市','盐城市','镇江市','南通市','昆山市','淮安市','连云港市','泰州市','宿迁市','江阴市','兴化市','丹阳市');
cities['浙江省']=new Array('杭州市','宁波市','温州市','金华市','台州市','绍兴市','嘉兴市','舟山市','湖州市','衢州市','丽水市','义乌市','余姚市','慈溪市','东阳市');
cities['安徽省']=new Array('合肥市', '宿州市', '淮北市', '淮南市', '蚌埠市', '马鞍山市', '安庆市', '阜阳市', '滁州市', '巢湖市', '铜陵市', '芜湖市', '六安市', '宣城市','黄山市','池州市','亳州市');
cities['福建省']=new Array('福州市', '泉州市', '厦门市', '漳州市', '龙岩市', '莆田市', '南平市', '三明市', '宁德市', '永安市', '福安市', '建瓯市');
cities['江西省']=new Array('南昌市','赣州市','上饶市','宜春市','九江市','新余市','抚州市','吉安市','景德镇市','萍乡市','鹰潭市','樟树市','上绕市');
cities['山东省']=new Array('烟台市','济南市','临沂市','青岛市','东营市','淄博市','潍坊市','济宁市','泰安市','威海市','德州市','滨州市','枣庄市','菏泽市','聊城市','日照市','莱芜市','蓬莱市','滕州市');
cities['河南省']=new Array('郑州市','洛阳市','平顶山市','南阳市','焦作市','新乡市','安阳市','漯河市','信阳市','濮阳市','周口市','开封市','商丘市','许昌市','驻马店市','三门峡市','济源市','鹤壁市','巩义市');
cities['湖北省']=new Array('武汉市','宜昌市','十堰市','襄阳市','荆州市','黄冈市','荆门市','潜江市','黄石市','咸宁市','鄂州市','孝感市','恩施市','随州市','天门市','仙桃市','松滋市');
cities['湖南省']=new Array('长沙市','岳阳市','衡阳市','株洲市','娄底市','益阳市','邵阳市','怀化市','郴州市','常德市','湘潭市','永州市','吉首市','张家界市','浏阳市','汨罗市');
cities['广东省']=new Array('深圳南山','深圳龙岗','深圳宝安','广州市','高州市','珠海市','中山市','汕头市','湛江市','惠州市','江门','东莞莞城四区','东莞厚街','东莞大朗','东莞常平','东莞石龙','东莞中堂','东莞望牛','东莞麻涌','东莞石碣','东莞高埗','东莞寮步','东莞横沥','东莞东坑','东莞企石','东莞石排','东莞茶山','东莞虎门','东莞长安','东莞沙田','东莞大岭山','东莞松山湖','东莞黄江','东莞凤岗','东莞塘厦','东莞谢岗','东莞清溪','东莞桥头','花都市','韶关市','肇庆市','清远市','云浮市','梅州市 ','河源市','阳江市','揭阳市','汕尾市','潮州市','佛山南海区','佛山禅城区','佛山三水区','佛山顺德区','佛山高明区','东莞樟木头');
cities['海南省']=new Array('海口市','三亚市','东方市','琼海市','儋州市');
cities['四川省']=new Array('成都市','绵阳市','宜宾市','南充市','乐山市','德阳市','泸州市','巴中市','眉山市','内江市','西昌市','自贡市','达州市','广元市','遂宁市','攀枝花市','雅安市','广安市','阆中市');
cities['贵州省']=new Array('贵阳市','遵义市','铜仁市','毕节市','凯里市','都匀市','安顺市','六盘水市','清镇市','兴义市','黔南州','郁匀市','福泉市','纳雍市','长顺市');
cities['云南省']=new Array('昆明市','曲靖市','大理市','德宏州','开远市','玉溪市','昭通市','思茅市','楚雄州','个旧市','丽江市','文山州','红河州','保山市','临沧市','楚雄市','怒江州','宣威市');
cities['陕西省']=new Array('西安市', '延安市', '铜川市', '渭南市', '咸阳市', '宝鸡市', '汉中市', '榆林市', '商洛地区', '安康地区');
cities['甘肃省']=new Array('兰州市', '嘉峪关市', '金昌市', '白银市', '天水市', '酒泉地区', '张掖地区', '武威地区', '庆阳地区', '平凉地区', '定西地区', '陇南地区', '临夏回族自治州', '甘南藏族自治州');
cities['青海省']=new Array('西安市','咸阳市','宝鸡市','渭南市','汉中市','榆林市','安康市','延安市','商洛市','铜川市','华阴市','韩城市');
cities['内蒙古自治区']=new Array('呼伦贝尔市','集宁市','临河市','满洲里市','商都市','通辽市','乌海市','乌兰察布市','乌兰浩特市','锡林郭勒盟','锡林浩特市','兴安盟','巴彦淖尔市','包头市','赤峰市','鄂尔多斯市','二连浩特市','海拉尔市','呼和浩特市','呼伦贝尔盟');
cities['广西壮族自治区']=new Array('百色市','北海市','北流市','岑溪市','崇左市','防城港市','贵港市','桂林市','桂平市','河池市','贺州市','来宾市','柳州市','南宁市','钦州市','融安市','梧州市','宜州市','玉林市');
cities['西藏自治区']=new Array('拉萨市','郎县');
cities['宁夏回族自治区']=new Array('固原市','青铜峡市','石嘴山市','吴忠市','银川市');
cities['新疆维吾尔自治区']=new Array('阿克苏市','阿勒泰地区','阿勒泰市','阿图什市','北屯市','博乐市','昌吉市','昌吉州','阜康市','哈密市','和田市','喀什市','克拉玛依市','库尔勒市','奎屯市','鄯善市','石河子市','塔城地区','塔城市','吐鲁番市','乌鲁木齐市','伊犁市','伊犁州','伊宁市');


function set_city(province, city)
{
    var pv, cv;
    var i, ii;

    pv=province.value;
    cv=city.value;
    city.length=1;
if(pv=='0') return;
if(typeof(cities[pv])=='undefined') return;

    for(i=0; i<cities[pv].length; i++)
    {
       ii = i+1;
       city.options[ii] = new Option();
       city.options[ii].text = cities[pv][i];
       city.options[ii].value = cities[pv][i];
    }

}

function cha(){
    if (document.myform.u_username.value=="")
    {
     alert("用户名不能为空！");
    }
    else
    {
     var str_cha = document.myform.u_username.value;
     location.href="cha.aspx?str=" + str_cha;
    }
}

function get_inf(cv, city){
    var i, ii, k;
    var res = new Array();
    for(k in cities){
        if(cities[k].indexOf( cv ) >= 0 ){
            res = k;
            for(i=0; i<cities[k].length; i++){
                ii = i+1;
                city.options[ii] = new Option();
                city.options[ii].text = cities[k][i];
                city.options[ii].value = cities[k][i];
            }
        }
    }
    return res;
}